README.md
- [Description of *Recent Mexican Election Vote Returns* repository](#org37251fc)
- [Codebook](#org6a4483a)
- [Sources](#orgbab64c4)
- [Acknowledgements](#orgdd3921a)

Last revision: 2022-01-30

---

Work in progress

---


<a id="org37251fc"></a>

# Description of *Recent Mexican Election Vote Returns* repository

-   Author: Eric Magar
-   Email: emagar at itam dot mx


<a id="org6a4483a"></a>

# Codebook


<a id="orgbab64c4"></a>

# Sources


<a id="orgdd3921a"></a>

# Acknowledgements

Eric Magar acknowledges financial support from the Asociación Mexicana de Cultura A.C. He is responsible for mistakes and shortcomings in the data.
